//----------------------------------------- 文件开始 ----------------------------------------------
#ifndef _KEY_H_
#define _KEY_H_


//	包含头文件
//-------------------------------------------------------------------------------------------------
#include <SI_EFM8BB1_Register_Enums.h>
//	配置
//------------------------------------------------------------------------------------------------- 

#define N_KEY			    0x00		// 无按键	
#define S_KEY_CH0			0x01		// KEY1 短按
#define S_KEY_CH1			0x02		// KEY2 短按
#define S_KEY_CH2			0x04		// KEY3 短按

#define L_KEY_CH0			0x41		// KEY1 长按3s
#define L_KEY_CH1		    0x42		// KEY2 长按3s
#define L_KEY_CH2		    0x44		// KEY3 长按3s

#define LL_KEY_CH0			0xC1		// KEY1 长按5s
#define LL_KEY_CH1		    0xC2		// KEY2 长按5s
#define LL_KEY_CH2		    0xC4		// KEY3 长按5s

#define L_KEY_MASK          0x40        // 3s
#define LL_KEY_MASK         0x80        // 5s

SI_SBIT (IO_KEY_CH0, SFR_P0, 7);

//	变量声明
//-------------------------------------------------------------------------------------------------
SI_SBIT (IO_WIFI_KEY0, SFR_P1, 3);


//	函数声明
//-------------------------------------------------------------------------------------------------
void Key_Action(void);

#endif
//----------------------------------------- 文件结束 ----------------------------------------------
